In [28]:
import numpy as np
import pandas as pd

## More ways to create a DataFrame

In [29]:
data_dict = {'x': [1, 2, 3], 'y': np.array([4, 5, 6]), 'z': 100}

In [30]:
# various elements, differnt order of columns
pd.DataFrame(data_dict, index=[100, 200, 300], columns=['z', 'y', 'x'])

       z  y  x
100  100  4  1
200  100  5  2
300  100  6  3

In [14]:
# creating a data frame from a list of dictionaries
data_dict_2 = [{"x": 1, "y": 2, "z": 100}, {"x": 2, "y": 4, "z": 100}, {"x": 33, "y": 8, "z": 100}]
pd.DataFrame(data_dict_2)

    x  y    z
0   1  2  100
1   2  4  100
2  33  8  100

In [18]:
data_dict_2 = [{"x": 1, "y": 2, "z": 100}, {"x": 2, "y": 4, "z": 100}, {"x": 33, "y": 8, "z": 100}]
frame_2 = pd.DataFrame(data_dict_2, index=['a', 'b', 'c'])
frame_2

    x  y    z
a   1  2  100
b   2  4  100
c  33  8  100

In [19]:
frame_2['x']

a     1
b     2
c    33
Name: x, dtype: int64

In [20]:
frame_2.loc['a']

x      1
y      2
z    100
Name: a, dtype: int64

In [21]:
frame_2[['x', 'y']].loc[['a', 'c']]

    x  y
a   1  2
c  33  8

In [26]:
# creating a data frame from a list
frame_3 = pd.DataFrame([[1, 2, 100], [2, 4, 100], [3, 8, 100]], index=['a', 'b', 'c'], columns=['x', 'y', 'z'])
frame_3

   x  y    z
a  1  2  100
b  2  4  100
c  3  8  100

In [27]:
frame_3[['y', 'x']].loc[['b', 'a']]

   y  x
b  4  2
a  2  1

In [33]:
# creating a data frame from a numpy array
arr = np.array([[1, 2, 100], [2, 4, 100], [3, 8, 100]])
frame_4 = pd.DataFrame(arr)
frame_4

   0  1    2
0  1  2  100
1  2  4  100
2  3  8  100

In [36]:
arr[2, 2] = 300
arr

array([[  1,   2, 100],
       [  2,   4, 100],
       [  3,   8, 300]])

In [38]:
# changes in the numpy array led to changes in the frame
frame_4

   0  1    2
0  1  2  100
1  2  4  100
2  3  8  300

In [40]:
# avoiding the changes in the frame
arr = np.array([[1, 2, 100], [2, 4, 100], [3, 8, 100]])
frame_5 = pd.DataFrame(arr, copy=True)
frame_5

   0  1    2
0  1  2  100
1  2  4  100
2  3  8  100

In [41]:
arr[2, 2] = 300
frame_5

   0  1    2
0  1  2  100
1  2  4  100
2  3  8  100